## 静态路由

### 技术原理

#### 拓扑图

![img](https://bfs.iloli.moe/img/2021/01/1ab56872ef878f08d64f5ee5a485efa6.png)

#### 要求

- Router1
  - 改名为R0
  - fa0/0接口IP为192.168.0.100/24
  - s0/0/0接口IP为10.0.0.1/8
- Router2
  - 改名为R1
  - fa0/0接口IP为192.168.1.100/24
  - s0/0/0接口IP为10.0.0.2/8
- 配置静态路由使全网互通

### 配置命令

#### R0

```
Router>en
Router#conf
R0(config)#hostname R0
R0(config)#int fa0/0
R0(config-if)#ip address 192.168.0.100 255.255.255.0
R0(config-if)#no shutdown 
R0(config-if)#int s0/0/0
R0(config-if)#no shutdown 
R0(config-if)#clock rate 64000
```

#### R1

```
Router>en
Router#conf
Router(config)#hostname R1
R1(config)#int s0/0/0
R1(config-if)#no shutdown 
R1(config-if)#ip add 10.0.0.2 255.0.0.0
R1(config-if)#int fa0/0
R1(config-if)#no shutdown 
R1(config-if)#
R1(config-if)#ip add 192.168.1.100 255.255.255.0
```

没配置静态路由之前，肯定是通不了的

![img](https://bfs.iloli.moe/img/2021/01/544b6657f6b32aca86159c552fbf77c2.png)

现在把静态路由给补上

#### 静态路由命令

格式：

```
ip route [网络号] [子网掩码] [下一跳地址]
```

##### R0

```
R0(config)#ip route 192.168.1.0 255.255.255.0 Serial0/0/0 # s0/0/0 对面的接口或IP
```

##### R1

```
R1(config)#ip route 192.168.0.0 255.255.255.0 s0/0/0 # s0/0/0 对面的接口或IP
```

## ![img](https://bfs.iloli.moe/img/2021/01/04caa94b8c0fd8dca5ba2aa92fdcad9c.png)

### 实验测试

PC0 ping 通PC1 即可

![img](https://bfs.iloli.moe/img/2021/01/7312a0f0b99fae82e905944cb2f21c4a.png)

## 缺省（默认）路由

### 技术原理

### 拓扑图

![img](https://bfs.iloli.moe/img/2021/01/ce2bd3ccd883165d314d5c3124b7e09c.png)

如图配置哈

### 配置命令

默认路由配置命令只需要一条

```
ip route 0.0.0.0 0.0.0.0 出接口或出口IP
```

### 实验测试

![img](https://bfs.iloli.moe/img/2021/01/475e3ca5f69d24defc4bdba979f7bacc.png)

## 动态路由RIP协议

### 技术原理

### 拓扑图

![img](https://bfs.iloli.moe/img/2021/01/dcbdd0bff1771d04077d0473532959d0.png)

#### 要求

- Router1
  - 改名为R0
  - fa0/0接口IP为192.168.0.100/24
  - s0/0/0接口IP为10.0.0.1/8
- Router2
  - 改名为R1
  - fa0/0接口IP为192.168.1.100/24
  - s0/0/0接口IP为10.0.0.2/8
- 配置静态路由使全网互通

### 配置命令

#### R0

```
Router>en
Router#conf
Router(config)#hostname R0
R0(config)#int fa0/0
R0(config-if)#ip add 10.0.0.1 255.0.0.0
R0(config-if)#int fa0/1
R0(config-if)#ip add 192.168.0.100 255.255.255.0
```

#### R1

```
Router>en
Router#conf
Router(config)#hostname R1
R1(config)#int fa0/0
R1(config-if)#no shutdown
R1(config-if)#ip add 10.0.0.2 255.0.0.0
R1(config-if)#int fa0/1
R1(config-if)#no shutdown
R1(config-if)#ip add 192.168.1.100 255.255.255.0
```

#### RIP配置

RIP有两个版本，分别是RIP1和RIP2，这里我们使用RIP2来配置本次实验

##### 命令格式

```
router rip
version 协议1或2
network 直连网段（sh ip ro）
```

##### R0

```
R0(config)#router rip
R0(config-router)#v 2
R0(config-router)#network 10.0.0.0
R0(config-router)#network 192.168.0.0
```

##### R1

```
R1(config)#router rip
R1(config-router)#v 2
R1(config-router)#net 10.0.0.0
R1(config-router)#net 192.168.1.0
```

### 实验测试

ping通即可

![img](https://bfs.iloli.moe/img/2021/01/ebae1675df5f8b8e0f409578617add26.png)

## 动态路由OSPF协议

### 技术原理

OSPF 是基于 Dijkstra 算法来工作的。首先， OSPF 要构建一个最短路径树，然后使用最佳路径的计算结果来组建路由选择表。 OSPF 的会聚也很快，虽然它可能没有 EIGRP 快，并且它也支持对相同目标的等价多路径路由。与 EIGRP 一样，它也支持四和 IPv6 被路由协议。

### 拓扑图

#### OSPF单区域

![img](https://bfs.iloli.moe/img/2021/01/d432e2d600c793aa3cd3939cac7fbe0b.png)

- R0：fa0/1:10.0.0.1/8
- R1：
  - fa0/0: 10.0.0.2/8
  - fa0/1: 172.16.0.1/16
- R2：
  - fa0/0: 172.16.0.2/16
- PC0：
  - IP:192.168.0.1/24
  - GW:192.168.0.100
- PC1：
  - IP:192.168.1.1/24
  - GW:192.168.1.100

#### OSPF多区域

![img](https://bfs.iloli.moe/img/2021/01/aae92ee7350f013d5b4dbba1c5088f47.png)

自己看图配置

[alert]记得配置客户端IP[/alert]

### 配置命令

#### OSPF配置格式

```
开启OFPF进程：router ospf [进程号] （1-65535）
宣告直连网络：network [网络号] [掩码] area [区域编号]（0-4294967295）
```

#### OSPF单区域

IP自己配，我懒的写

##### R0

```
router ospf 1
network 10.0.0.0 0.255.255.255 area 0
network 192.168.0.0 0.0.0.255 area 0
```

##### R1

```
router ospf 1
network 10.0.0.0 0.255.255.255 area 0
network 172.16.0.0 0.0.255.255 area 0
```

##### R2

```
router ospf 1
network 172.16.0.0 0.0.255.255 area 0
network 192.168.1.0 0.0.0.255 area 0
```

#### OSPF多区域

##### IP配置

###### R0

```
Router>en
Router#conf
Router(config)#int s0/0/0
Router(config-if)#no shutdown 
Router(config-if)#ip add 172.15.0.1 255.255.0.0
Router(config-if)#clock rate 64000
Router(config-if)#int fa0/0
Router(config-if)#no shutdown 
Router(config-if)#ip add 192.168.10.100 255.255.255.0
Router(config-if)#int fa0/1
Router(config-if)#ip add 192.168.20.100 255.255.255.0
Router(config-if)#no shutdown
```

###### R1

```
Router>en
Router#conf
Router(config)#int fa0/0
Router(config-if)#ip add 10.10.10.100 255.0.0.0
Router(config-if)#int fa0/1
Router(config-if)#ip add 11.11.11.100 255.0.0.0
Router(config-if)#int s0/0/0
Router(config-if)#ip add 172.15.0.2 255.255.0.0
Router(config-if)#int s0/0/1
Router(config-if)#clock rate 64000
Router(config-if)#ip add 12.0.0.1 255.0.0.0
```

###### R2

```
Router>en
Router#conf
Router(config)#int s0/0/1
Router(config-if)#ip add 12.0.0.2 255.0.0.0
Router(config-if)#int fa0/0
Router(config-if)#ip add 172.16.0.100 255.255.0.0
Router(config-if)#int fa0/1
Router(config-if)#ip add 172.17.0.100 255.255.0.0
```

##### OSPF部分

###### R0

```
Router(config)#router ospf 1
Router(config-router)#net 172.15.0.0 0.0.255.255 area 0
Router(config-router)#net 192.168.10.0 0.0.0.255 area 0
Router(config-router)#net 192.168.20.0 0.0.0.255 area 0
```

###### R1

```
Router(config)#router ospf 1
Router(config-router)#net 172.15.0.0 0.0.255.255 area 0
Router(config-router)#net 192.168.10.0 0.0.0.255 area 0
Router(config-router)#net 192.168.20.0 0.0.0.255 area 0
Router(config-router)#net 10.0.0.0 0.255.255.255 area 1
Router(config-router)#net 11.0.0.0 0.255.255.255 area 1
Router(config-router)#net 12.0.0.0 0.255.255.255 area 1
Router(config-router)#net 172.15.0.0 0.0.255.255 area 1
Router(config-router)#net 12.0.0.0 0.255.255.255 area 2
Router(config-router)#net 172.16.0.0 0.0.255.255 area 2
Router(config-router)#net 172.17.0.0 0.0.255.255 area 2
```

###### R2

```
Router(config)#router ospf 1
Router(config-router)#net 12.0.0.0 0.255.255.255 area 2
Router(config-router)#net 172.16.0.0 0.0.255.255 area 2
Router(config-router)#net 172.17.0.0 0.0.255.255 area 2
```

### 实验测试

全网互通（OSPF）

![img](https://bfs.iloli.moe/img/2021/01/ccc603652a1301b239ea88c7371e0942.png)

#### 多区域

![img](https://bfs.iloli.moe/img/2021/01/bba894b044919a6b79688b619286360a.png)

## 单臂路由

### 技术原理

单臂路由：是为实现VLAN间通信的三层网络设备路由器，它只需要一个以太网，通过创建子接口可以承担所有VLAN的网关，而在不同的VLAN间转发数据。

### 拓扑图

![img](https://bfs.iloli.moe/img/2021/01/aa37395821e37151777911e2cfbdc14f.png)

自己看图自己配置，g1/1接口配置trunk模式，PC0到3全部接入到VLAN1-4

### 配置命令

#### Router

```
Router>en
Router#conf
Router(config)#int range g0/0-1
Router(config-if-range)#no shu
Router(config-if-range)#no shutdown
```

##### 单臂路由配置

```
Router(config)#int g0/0.1 # 进入路由器0模块第0端口第1子接口
Router(config-subif)#encapsulation dot1Q 1 # 1 为 vlan ID
Router(config-subif)#ip address 192.168.0.100 255.255.255.0 
Router(config)#int g0/0.2
Router(config-subif)#encapsulation dot1Q 2
Router(config-subif)#ip address 192.168.1.100 255.255.255.0 
Router(config)#int g0/1.1
Router(config-subif)#encapsulation dot1Q 3
Router(config-subif)#ip address 192.168.2.100 255.255.255.0 
Router(config)#int g0/1.2
Router(config-subif)#encapsulation dot1Q 4
Router(config-subif)#ip address 192.168.3.100 255.255.255.0
```

#### Switch0

```
Switch>en
Switch#conf
Switch(config)#int fa0/1
Switch(config-if)#sw ac vlan 1
Switch(config-if)#int fa0/2
Switch(config-if)#sw ac vlan 2
Switch(config-if)#int g1/1
Switch(config-if)#sw mo tr
```

#### Switch1

```
Switch>en
Switch#conf
Switch(config)#int g1/1
Switch(config-if)#sw mo tr
Switch(config-if)#int fa0/1
Switch(config-if)#sw ac vlan 3
Switch(config-if)#int fa0/2
Switch(config-if)#sw ac vlan 4
```

### 实验测试

全网互通即可

![img](https://bfs.iloli.moe/img/2021/01/630323ba002d8212cde33a86cb96d053.png)

## OSPF区域认证

### 拓扑图

![img](https://bfs.iloli.moe/img/2021/01/7bb41224628d6cf663a52969a600f1e6.png)

### 配置命令

#### Router0

```
Router>en
Router#conf
Router(config)#int range fa0/0-1
Router(config-if-range)#no shutdown 
Router(config-if-range)#int fa0/0
Router(config-if)#ip address 192.168.1.254 255.255.255.0
Router(config-if)#int fa0/1
Router(config-if)#ip address 172.16.0.1 255.255.0.0
Router(config)#router ospf 1
Router(config-router)#net 172.16.0.0 255.255.0.0 area 0
Router(config-router)#net 192.168.1.0 255.255.255.0 area 0
Router(config-router)#area 0 authentication message-digest #开启区域认证
Router(config-router)#int fa0/1
Router(config-if)#ip ospf message-digest-key 1 md5 abc #进入接口配置认证密钥，两方密钥必须相同否则ping不通
```

#### Router1

```
Router>en
Router#conf
Router(config)#int range fa0/0-1
Router(config-if-range)#no shutdown 
Router(config-if-range)#int fa0/1
Router(config-if)#ip address 172.16.0.2 255.255.0.0
Router(config-if)#int fa0/0
Router(config-if)#ip address 192.168.2.254 255.255.255.0
Router(config)#router ospf 1
Router(config-router)#net 172.16.0.0 255.255.0.0 area 0
Router(config-router)#net 192.168.2.0 255.255.255.0 area 0
Router(config-router)#area 0 authentication message-digest 
Router(config)#int fa0/1
Router(config-if)#ip ospf message-digest-key 1 md5 abc
```

## 增强内部网关路由选择协议

EIGRP (Enhanced Interior Gateway Routing Protocol ，增强内部网关路由选择协议)是一个思科的专用协议，它只运行在思科路由器上。由于 EIGRP 是目前最为流行的两个路由选择协议中的一个，因此，理解宫是非常重要的。本章将会对 EIGRP 进行详尽的介绍，并对其工作方式进行细致的描述，在这个过程中，我们将特别关注其发现、选择及通告路由的独特方式。

![img](https://bfs.iloli.moe/img/2021/01/f8f8026f680ad809e654952e7ded8a40.png)

[alert]

EIGRP默认最多可以支持4条链路的负载均衡

但我们可以通过router eigrp [paths] 修改EIGRP的负载均衡链路

另外EIGRP默认最大跳计数值为100，如果需要可以修改

router eigrp 10

metric maximum-hops [Count]

[/alert]

### 配置命令

#### R1

```
router eigrp 10
network 1.0.0.0
network 192.168.0.0
```

#### R2

```
router eigrp 10
network 1.0.0.0
network 192.168.1.0
no auto-summary
```

## 热备份路由协议

HSRP(热备份路由协议)：是思科私有的一种技术，它确保了的那个网络边缘设备或接入链路出现故障时，用户通信能迅速并透明地恢复，以此为IP网络提供冗余性。热备份路由协议为IP网络提供容错和增强的路由选择功能。通过使用一个虚拟的IP地址和虚拟MAC地址，LAN网段上的两台或者多台路由器可以作为一台虚拟路由器对外提供服务。 ———————————————— 版权声明：本文为CSDN博主「数据恢复_邓奇」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。 原文链接：https://blog.csdn.net/u012953265/article/details/38292593

1、 设置虚拟接口
Standby 编号 ip IP地址
2、 设置端口优先级（实现自动切换）
优先级大的为活动网关（active），优先级小的备份网关（）
standby 编号 priority 优先级数（默认100）
3、 设置跟踪端口 用于监听hello包
Standby 编号 track 端口号
4、开启抢占模式 活动网关和备份网关都会开启抢占模式
Standby 编号 preempt
5、 Hello时间（每隔一段时间，检测跟踪）
Standby编号 timers 3 10
（3秒一次，10秒后未收到回复默认对方关闭）

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 

 